vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1182_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MIMXRT1182_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MIMXRT1182</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="25.09.00" date="2025-09-19">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00</release>
    <release version="25.09.00-pvw2" date="2025-08-12">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00-pvw2</release>
    <release version="25.09.00-pvw1" date="2025-07-14">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00-pvw1</release>
    <release version="25.06.00" date="2025-06-24">NXP CMSIS Packs based on MCUXpresso SDK 25.06.00</release>
    <release version="25.06.00-pvw2" date="2025-05-19">NXP CMSIS Packs based on MCUXpresso SDK 25.06.00-pvw2</release>
    <release version="25.03.00" date="2025-03-28">NXP CMSIS Packs based on MCUXpresso SDK 25.03.00</release>
    <release version="19.0.0" date="2024-07-17">NXP CMSIS Packs based on MCUXpresso SDK 2.16.0</release>
    <release version="18.0.0" date="2024-02-07">NXP CMSIS Packs based on MCUXpresso SDK 2.15.0</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="6.1.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="MIMXRT1182" Dvendor="NXP:11">
      <description>i.MX RT1180</description>
      <device Dname="MIMXRT1182xxxxx">
        <processor Dcore="Cortex-M33" Dfpu="SP_FPU" Dmpu="MPU" Dtz="TZ" Ddsp="DSP" Dendian="Little-endian" Dclock="240000000"/>
        <environment name="iar">
          <file category="linkerfile" name="devices/MIMXRT1182/iar/MIMXRT1182xxxxx_ram.icf"/>
        </environment>
        <sequences>
          <sequence name="ShowReg">
            <block>
              __var SI_VER_ADDR     = 0x5751804C;
              __var SCB_AIRCR_ADDR  = 0xE000ED0C;
              __var DCB_DHCSR_ADDR  = 0xE000EDF0;
              __var DCB_DEMCR_ADDR  = 0xE000EDFC;
              __var DWT_COMP0_ADDR  = 0xE0001020;
              __var DWT_FUNC0_ADDR  = 0xE0001028;
              __var SRC_SRSR_ADDR   = 0x44460050;
              __var SRC_SRMASK_ADDR = 0x54460018;
              __var SRC_AUTHEN_CTRL_ADDR = 0x44460004;
              
              __var r;
              __var debug = 0;
            </block>
            <control if="(debug == 1)">
              <block>
                r = Read32(SCB_AIRCR_ADDR);
                Message(0, "    SCB_AIRCR_ADDR = %x", r);
                r = Read32(DCB_DHCSR_ADDR);
                Message(0, "    DCB_DHCSR_ADDR = %x", r);
                r = Read32(DCB_DEMCR_ADDR);
                Message(0, "    DCB_DEMCR_ADDR = %x", r);
                
                r = Read32(DWT_COMP0_ADDR);
                Message(0, "    DWT_COMP0_ADDR = %x", r);
                r = Read32(DWT_FUNC0_ADDR);
                Message(0, "    DWT_FUNC0_ADDR = %x", r);
                
                r = Read32(SRC_SRSR_ADDR);
                Message(0, "    SRC_SRSR_ADDR = %x", r);
                r = Read32(SRC_SRMASK_ADDR);
                Message(0, "    SRC_SRMASK_ADDR = %x", r);
                r = Read32(SRC_AUTHEN_CTRL_ADDR);
                Message(0, "    SRC_AUTHEN_CTRL_ADDR = %x", r);
              </block>
            </control>
          </sequence>
          <sequence name="ResetSystem">
            <block>
              __var SI_VER_ADDR     = 0x5751804C;
              __var SCB_AIRCR_ADDR  = 0xE000ED0C;
              __var DCB_DHCSR_ADDR  = 0xE000EDF0;
              __var DCB_DCRSR_ADDR  = 0xE000EDF4;
              __var DCB_DCRDR_ADDR  = 0xE000EDF8;
              __var DCB_DEMCR_ADDR  = 0xE000EDFC;
              __var DWT_COMP0_ADDR  = 0xE0001020;
              __var DWT_FUNC0_ADDR  = 0xE0001028;
              __var SRC_SRSR_ADDR   = 0x44460050;
              __var SRC_SRMASK_ADDR = 0x54460018;
              __var SRC_AUTHEN_CTRL_ADDR = 0x44460004;
              
              __var r;
              __var w;
              __var comp0;
              __var func0;
              __var core_reset_request_bit_mask;
              __var rom_trap_addr;
              
              Message(0, "Step in CM33 ResetSystem");
            </block>
            <block>
              r = Read32(SI_VER_ADDR) &amp; 0xF;
              rom_trap_addr = 0x10002932;
            </block>
            <control if="(r == 1)">
              <block>rom_trap_addr = 0x100025D4;</block>
            </control>
            <control if="(r == 2)">
              <block>rom_trap_addr = 0x100025D4;</block>
            </control>
            <block>Message(0, "  Ver = %x, trap_addr = 0x%x", r, rom_trap_addr);</block>
            <block>
              // Halt the CPU and wait sometime for possible peripheral operation finish
              Write32(DCB_DHCSR_ADDR, 0xA05F0003);
              DAP_Delay(10000);
              r = Read32(DCB_DHCSR_ADDR) &amp; 0x2;
            </block>
            <control if="(r == 0)">
              <block>Message(0, "  ERR: CM33 core can't be halted!");</block>
            </control>
            <block>Sequence("ShowReg");</block>
            <block>
              // check and enable core request system reset
              core_reset_request_bit_mask = 0x100;  // for CM33 core
              r = Read32(SRC_SRMASK_ADDR);
            </block>
            <control if="(r &amp; core_reset_request_bit_mask) != 0">
              <control if="(r &amp; (core_reset_request_bit_mask &lt;&lt; 16)) != 0">
                <block>Message(0, "  ERR: Core reset request is masked and locked!");</block>
              </control>
              <control if="(r &amp; (core_reset_request_bit_mask &lt;&lt; 16)) == 0">
                <block>
                  w = r &amp; (~core_reset_request_bit_mask);
                  r = Read32(SRC_AUTHEN_CTRL_ADDR);
                </block>
                <control if="(r &amp; 0x80) == 0">
                  <block>
                    Message(0, "  Enable system reset via CM33 core reset");
                    Write32(SRC_SRMASK_ADDR, w);
                  </block>
                </control>
                <control if="(r &amp; 0x80) != 0">
                  <block>Message(0, "  ERR: Core reset request is masked and all mask are locked!");</block>
                </control>
              </control>
            </control>
            <block>Sequence("ShowReg");</block>
            <block>
              Message(0, "  Set CM33 watch point");
              comp0 = Read32(DWT_COMP0_ADDR); // Save the DWT register and restore them later
              func0 = Read32(DWT_FUNC0_ADDR);
              Write32(DCB_DEMCR_ADDR, 0x01000000);    // Enable DWT of CM33 core
              Write32(DWT_COMP0_ADDR, rom_trap_addr);
              Write32(DWT_FUNC0_ADDR, 0x00000412);
              
              // Clear the reset status to avoid ROM clean the core TCM after reset
              r = Read32(SRC_SRSR_ADDR);
              Write32(SRC_SRSR_ADDR, r);
            </block>
            <block>Sequence("ShowReg");</block>
            <block>
              Message(0, "  Execute SYSRESETREQ via AIRCR");
              Write32(SCB_AIRCR_ADDR, 0x05FA0004);
              DAP_Delay(100000);
            </block>
            <block>Sequence("ShowReg");</block>
            <block>r = Read32(DWT_FUNC0_ADDR);</block>
            <control if="(r &amp; 0x01000000) == 0">
              <block>Message(0, "  ERR: CM33 core is not trapped!");</block>
            </control>
            <control if="(r &amp; 0x01000000) != 0">
              <block>Message(0, "  CM33 core is trapped after system reset!");</block>
            </control>
            <block>r = Read32(DCB_DHCSR_ADDR) &amp; 0x2;</block>
            <control if="r != 0">
              <block>
                Message(0, "  Restore CM33 watch point");
                Write32(DWT_COMP0_ADDR, comp0);
                Write32(DWT_FUNC0_ADDR, func0);
              </block>
            </control>
            <control if="r == 0">
              <block>Message(0, "  ERR: CM33 is not halted after reset!");</block>
            </control>
            <block>
              // Write SPLIM as 0 before exit
              Write32(DCB_DCRDR_ADDR, 0x0);
              Write32(DCB_DCRSR_ADDR, 0x1001C);
              Message(0, "Step out CM33 ResetSystem");
            </block>
          </sequence>
          <sequence name="DebugPortStart">
            <block>
              __var SW_DP_ABORT  = 0x0;
              __var DP_CTRL_STAT = 0x4;
              __var DP_SELECT    = 0x8;
              __var powered_down = 0;
              // Switch to DP Register Bank 0
              WriteDP(DP_SELECT, 0x00000000);
              // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
              powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
            </block>
            <control if="powered_down">
              <block>
                // Request Debug/System Power-Up
                WriteDP(DP_CTRL_STAT, 0x50000000);
              </block>
              <!-- Wait for Power-Up Request to be acknowledged -->
              <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000"/>
              <!-- JTAG Specific Part of sequence -->
              <control if="(__protocol &amp; 0xFFFF) == 1">
                <block>
                  // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                  // Additionally clear STICKYORUN, STICKYCMP, and STICKYERR bits by writing '1'
                  WriteDP(DP_CTRL_STAT, 0x50000F32);
                </block>
              </control>
              <!-- SWD Specific Part of sequence -->
              <control if="(__protocol &amp; 0xFFFF) == 2">
                <block>
                  // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                  WriteDP(DP_CTRL_STAT, 0x50000F00);
                  
                  // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
                  WriteDP(SW_DP_ABORT, 0x0000001E);
                </block>
              </control>
            </control>
          </sequence>
        </sequences>
        <memory name="ROMCP" start="0x00000000" size="0x028000" access="rx" default="1"/>
        <memory name="SRAM_DTC_cm33" start="0x20000000" size="0x020000" access="rw" default="1"/>
        <memory name="SRAM_ITC_cm33" start="0x0ffe0000" size="0x020000" access="rw" default="1"/>
        <memory name="SRAM_OC1" start="0x20484000" size="0x07c000" access="rw" default="1"/>
        <memory name="SRAM_OC2" start="0x20500000" size="0x040000" access="rw" default="1"/>
        <algorithm name="devices/MIMXRT1182/arm/MIMXRT1180_EVK_FSPI1_QSPI_CM33.FLM" start="0x28000000" size="0x1000000" RAMstart="0x20000000" RAMsize="0x20000" default="1"/>
        <debug svd="devices/MIMXRT1182/MIMXRT1182.xml"/>
        <variant Dvariant="MIMXRT1182CVP2B">
          <compile header="devices/MIMXRT1182/fsl_device_registers.h" define="CPU_MIMXRT1182CVP2B"/>
        </variant>
        <variant Dvariant="MIMXRT1182XVP2B">
          <compile header="devices/MIMXRT1182/fsl_device_registers.h" define="CPU_MIMXRT1182XVP2B"/>
        </variant>
        <variant Dvariant="MIMXRT1182CVP2C">
          <compile header="devices/MIMXRT1182/fsl_device_registers.h" define="CPU_MIMXRT1182CVP2C"/>
        </variant>
        <variant Dvariant="MIMXRT1182XVP2C">
          <compile header="devices/MIMXRT1182/fsl_device_registers.h" define="CPU_MIMXRT1182XVP2C"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MIMXRT1182.internal_condition">
      <accept Dname="MIMXRT1182CVP2B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1182CVP2C" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1182XVP2B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1182XVP2C" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MIMXRT1182.internal_condition"/>
    </condition>
