vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1182_DFP.pdsc
    <condition id="allOf.component.log, driver.common, utility.debug_console_lite, device=MIMXRT1182.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="component.log.backend.ringbuffer.condition_id">
      <require condition="allOf.component.log, driver.common, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, device=MIMXRT1182.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="component.lpi2c_adapter.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, component.i2c_adapter_interface, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpi2c, component.i2c_adapter_interface, device=MIMXRT1182.internal_condition">
      <require condition="anyOf.driver.lpi2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="component.lpit_adapter.condition_id">
      <require condition="allOf.driver.lpit, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpit, device=MIMXRT1182.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpit"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="component.lptmr_adapter.condition_id">
      <require condition="allOf.driver.lptmr, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lptmr, device=MIMXRT1182.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="component.lpuart_adapter.condition_id">
      <require condition="allOf.anyOf=driver.lpuart, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpuart, device=MIMXRT1182.internal_condition">
      <require condition="anyOf.driver.lpuart.internal_condition"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpuart.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="device.MIMXRT1181.internal_condition">
      <accept Dname="MIMXRT1181CVP2B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1181CVP2C" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1181XVP2B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1181XVP2C" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.MIMXRT1187.internal_condition">
      <accept Dname="MIMXRT1187AVM8B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1187AVM8C" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1187CVM8B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1187CVM8C" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1187XVM8B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1187XVM8C" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.MIMXRT1189.internal_condition">
      <accept Dname="MIMXRT1189CVM8B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1189CVM8C" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1189XVM8B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1189XVM8C" Dvendor="NXP:11"/>
    </condition>
    <condition id="component.mcux-edgelock.s400.condition_id">
      <require condition="allOf.board=evkmimxrt1180, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.board=evkmimxrt1180, device=MIMXRT1182.internal_condition">
      <require condition="board.evkmimxrt1180.internal_condition"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="board.evkmimxrt1180.internal_condition">
      <accept condition="device.MIMXRT1181.internal_condition"/>
      <accept condition="device.MIMXRT1182.internal_condition"/>
      <accept condition="device.MIMXRT1187.internal_condition"/>
      <accept condition="device.MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="component.mcxw_flash_adapter.condition_id">
      <require condition="allOf.driver.romapi, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.driver.romapi, device=MIMXRT1182.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="component.mflash_offchip.condition_id">
      <require condition="allOf.anyOf=driver.cache_xcache, driver.flexspi, driver.romapi, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.cache_xcache, driver.flexspi, driver.romapi, device=MIMXRT1182.internal_condition">
      <require condition="anyOf.driver.cache_xcache, driver.flexspi, driver.romapi.internal_condition"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.cache_xcache, driver.flexspi, driver.romapi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_xcache"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
    </condition>
    <condition id="allOf.boards=evkmimxrt1180.condition_id">
      <require condition="boards.evkmimxrt1180.internal_condition"/>
    </condition>
    <condition id="boards.evkmimxrt1180.internal_condition">
      <accept condition="device.MIMXRT1181.internal_condition"/>
      <accept condition="device.MIMXRT1182.internal_condition"/>
      <accept condition="device.MIMXRT1187.internal_condition"/>
      <accept condition="device.MIMXRT1189.internal_condition"/>
    </condition>
