vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1182_DFP.pdsc
    <condition id="component.wifi_bt_module.config.condition_id">
      <require condition="allOf.anyOf=component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X, device=MIMXRT1182.internal_condition">
      <require condition="anyOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X.internal_condition"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="anyOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_88w8987"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_iw416"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_iw61x"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_rw61x"/>
    </condition>
    <condition id="component.wifi_bt_module.nb_fw.condition_id">
      <require condition="allOf.device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.tx_pwr_limits.condition_id">
      <require condition="allOf.device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.wifi_bt_combo_fw.condition_id">
      <require condition="allOf.device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.wifi_fw.condition_id">
      <require condition="allOf.device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.wifi_nb_combo_fw.condition_id">
      <require condition="allOf.device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="component.wm8524_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="component.wm8904_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="component.wm8960_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="component.wm8962_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="device.CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device=MIMXRT1182.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="device.RTE.condition_id">
      <require condition="allOf.device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="device.boot_header.condition_id">
      <require condition="allOf.device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="device.linker.condition_id">
      <require condition="allOf.device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MIMXRT1182xxxxx.internal_condition">
      <require condition="device_id.MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="device_ids.MIMXRT1182xxxxx.internal_condition">
      <accept Dname="MIMXRT1182CVP2B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1182CVP2C" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1182XVP2B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1182XVP2C" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, device_ids=MIMXRT1182xxxxx.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="device_ids.MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, device_ids=MIMXRT1182xxxxx.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="device_ids.MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=iar, device_ids=MIMXRT1182xxxxx.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="device_ids.MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="device.project_template.condition_id">
      <require condition="allOf.device_id=MIMXRT1182xxxxx, CMSIS_Include_core_cm, device.startup, driver.common, driver.clock, driver.rgpio, driver.iomuxc, driver.memory, driver.ele_base_api, driver.dcdc_3, driver.gpc_3, driver.anadig_pmu_1, driver.src_3, driver.misc, device.boot_header, component.lpuart_adapter, utility.debug_console_lite, utility.assert_lite, utility.str, anyOf=driver.cache_xcache.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MIMXRT1182xxxxx, CMSIS_Include_core_cm, device.startup, driver.common, driver.clock, driver.rgpio, driver.iomuxc, driver.memory, driver.ele_base_api, driver.dcdc_3, driver.gpc_3, driver.anadig_pmu_1, driver.src_3, driver.misc, device.boot_header, component.lpuart_adapter, utility.debug_console_lite, utility.assert_lite, utility.str, anyOf=driver.cache_xcache.internal_condition">
      <require condition="device_id.MIMXRT1182xxxxx.internal_condition"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup" Csub=""/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="iomuxc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="memory"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ele_base_api"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dcdc_soc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpc_3"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pmu_1"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="soc_src"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="misc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="xip_device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="anyOf.driver.cache_xcache.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.cache_xcache.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_xcache"/>
    </condition>
