vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1182_DFP.pdsc
    <condition id="device.startup.condition_id">
      <require condition="allOf.device.system, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.device.system, device=MIMXRT1182.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1182_system"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
    </condition>
    <condition id="device.system.condition_id">
      <require condition="allOf.device.CMSIS, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.device.CMSIS, device=MIMXRT1182.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1182_header"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="driver.acmp.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MIMXRT1182xxxxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.ak4497.condition_id">
      <require condition="allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MIMXRT1182.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="driver.anadig_pmu_1.condition_id">
      <require condition="allOf.device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="driver.aoi.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.asrc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.asrc_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.asrc, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.asrc, device=MIMXRT1182.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="asrc"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.edma4.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="driver.cache_xcache.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpi2c.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MIMXRT1182xxxxx, device.RTE, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MIMXRT1182xxxxx, device.RTE, device_id=MIMXRT1182xxxxx.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpi2c, device_id=MIMXRT1182xxxxx.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpi2c, device_id=MIMXRT1182xxxxx.internal_condition">
      <accept condition="allOf.driver.lpi2c, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpi2c, device_id=MIMXRT1182xxxxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device_id.MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpspi.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MIMXRT1182xxxxx, device.RTE, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MIMXRT1182xxxxx, device.RTE, device_id=MIMXRT1182xxxxx.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require condition="anyOf.allOf=driver.lpspi, device_id=MIMXRT1182xxxxx.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpspi, device_id=MIMXRT1182xxxxx.internal_condition">
      <accept condition="allOf.driver.lpspi, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpspi, device_id=MIMXRT1182xxxxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device_id.MIMXRT1182xxxxx.internal_condition"/>
    </condition>
