vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1182_DFP.pdsc
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="driver.pf5020.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="driver.pwm.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.qtmr_1.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.rgpio.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.romapi.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="driver.rtt.condition_id">
      <require condition="allOf.driver.rtt.template, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.driver.rtt.template, device=MIMXRT1182.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="driver.rtt.template.condition_id">
      <require condition="allOf.device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="driver.rtwdog.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.s3mu.condition_id">
      <require condition="allOf.device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.sai.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.sai_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.sai, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.sai, device=MIMXRT1182.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="driver.sema42.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.sgtl5000.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=MIMXRT1182.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="driver.spdif.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.spdif_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.spdif, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.spdif, device=MIMXRT1182.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spdif"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="driver.src_3.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="driver.sysctr.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.syspm.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.tempsensor.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.tfa9896.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.tfa9896_adapter, driver.codec, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.tfa9896_adapter, driver.codec, device=MIMXRT1182.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9896_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="driver.tfa9xxx.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.tfa9xxx_adapter, driver.codec, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.tfa9xxx_adapter, driver.codec, device=MIMXRT1182.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="driver.tfa9xxx_hal.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, driver.codec, driver.tfa9xxx, device=MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, driver.codec, driver.tfa9xxx, device=MIMXRT1182.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx"/>
      <require condition="device.MIMXRT1182.internal_condition"/>
    </condition>
    <condition id="driver.tpm.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1182xxxxx.internal_condition"/>
    </condition>
