vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1182_DFP.pdsc
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1182_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MIMXRT1182_cmsis</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1182/MIMXRT1182.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1182/MIMXRT1182_features.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1182/MIMXRT1182_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_ADC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_ANADIG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_ANADIG_LDO_BBSM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_ANADIG_MISC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_ANADIG_OSC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_ANADIG_PLL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_ANADIG_PMU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_ANADIG_TEMPSENSOR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_AOI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_ASRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_AXBS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_BBNSM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_BLK_CTRL_BBSMMIX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_BLK_CTRL_NS_AONMIX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_BLK_CTRL_S_AONMIX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_BLK_CTRL_WAKEUPMIX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_CACHE_ECC_MCM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_CAN.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_CCM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_CMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_DAC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_DCDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_DMA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_DMA4.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_ECAT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_EIM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_ENETC_GLOBAL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_ENETC_PCI_TYPE0.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_ENETC_PF_EMDIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_ENETC_PF_TMR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_ENETC_SI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_ENETC_VF_PCI_TYPE0.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_EQDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_ERM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_EWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_FLEXIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_FLEXSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_FLEXSPI_SLV.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_GPC_CPU_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_GPC_GLOBAL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_GPC_SYS_SLEEP_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_GPT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_I2S.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_I3C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_IEE.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_IEE_APC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_IERC_IERB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_IERC_PCI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_IOMUXC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_IOMUXC_AON.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_KPP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_LPI2C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_LPIT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_LPSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_LPTMR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_LPUART.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_M7_MCM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_MECC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_MSGINTR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_MU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_NETC_ENETC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_NETC_ETH_LINK.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_NETC_IERB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_NETC_PORT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_NETC_PRIV.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_NETC_PSEUDO_LINK.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_NETC_SW.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_NETC_SW_ENETC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_OCOTP_FSB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_OSC_RC_400M.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_OTFAD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_PDM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_PHY_LDO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_PLL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_PWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_RGPIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_RTWDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_S3MU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_SEMA42.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_SEMC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_SINC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_SPDIF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_SRC_GENERAL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_SRC_MIF_LN28FDSOI_SPLLRAM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_SRC_MIF_S28SPREGH.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_SRC_MIF_S28SPREGH_PSWA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_SRC_MIX_SLICE.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_SYSPM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_SYS_CTR_COMPARE.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_SYS_CTR_CONTROL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_SYS_CTR_READ.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_TCM_ECC_MCM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_TMPSNS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_TMR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_TPM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_TRDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_TSTMR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_USB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_USBHSDCD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_USBNC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_USBPHY.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_USDHC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_VMBANDGAP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_VREF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_XBAR_NUM_OUT221.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_XBAR_NUM_OUT32.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1182/periph/PERI_XCACHE.h" projectpath="device/periph"/>
        <file category="include" name="devices/MIMXRT1182/"/>
        <file category="include" name="devices/MIMXRT1182/periph/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT1182/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT1182/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="xip_device" Cversion="1.0.0" condition="device.boot_header.condition_id">
      <description>Device Boot Header</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1182/xip/fsl_flexspi_nor_boot.c" projectpath="xip"/>
        <file category="header" name="devices/MIMXRT1182/xip/fsl_flexspi_nor_boot.h" projectpath="xip"/>
        <file category="include" name="devices/MIMXRT1182/xip/"/>
      </files>
    </component>
