vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1182_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MIMXRT1182_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MIMXRT1182_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1182xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1182/arm/MIMXRT1182xxxxx_flexspi_nor.scf" version="1.0.0" projectpath="MIMXRT1182/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1182xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1182/arm/MIMXRT1182xxxxx_ram.scf" version="1.0.0" projectpath="MIMXRT1182/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1182xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1182/arm/MIMXRT1182xxxxx_flexspi_nor_hyperram.scf" version="1.0.0" projectpath="MIMXRT1182/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1182xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1182/arm/MIMXRT1182xxxxx_hyperram.scf" version="1.0.0" projectpath="MIMXRT1182/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1182xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1182/arm/MIMXRT1182xxxxx_hyperram_txt.scf" version="1.0.0" projectpath="MIMXRT1182/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1182xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1182/gcc/MIMXRT1182xxxxx_flexspi_nor.ld" version="1.0.0" projectpath="MIMXRT1182/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1182xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1182/gcc/MIMXRT1182xxxxx_ram.ld" version="1.0.0" projectpath="MIMXRT1182/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1182xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1182/gcc/MIMXRT1182xxxxx_flexspi_nor_hyperram.ld" version="1.0.0" projectpath="MIMXRT1182/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1182xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1182/gcc/MIMXRT1182xxxxx_hyperram.ld" version="1.0.0" projectpath="MIMXRT1182/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1182xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1182/gcc/MIMXRT1182xxxxx_hyperram_txt.ld" version="1.0.0" projectpath="MIMXRT1182/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1182xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1182/iar/MIMXRT1182xxxxx_flexspi_nor.icf" version="1.0.0" projectpath="MIMXRT1182/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1182xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1182/iar/MIMXRT1182xxxxx_ram.icf" version="1.0.0" projectpath="MIMXRT1182/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1182xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1182/iar/MIMXRT1182xxxxx_flexspi_nor_hyperram.icf" version="1.0.0" projectpath="MIMXRT1182/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1182xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1182/iar/MIMXRT1182xxxxx_hyperram.icf" version="1.0.0" projectpath="MIMXRT1182/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1182xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1182/iar/MIMXRT1182xxxxx_hyperram_txt.icf" version="1.0.0" projectpath="MIMXRT1182/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MIMXRT1182" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MIMXRT1182</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT1182/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1182/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1182/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1182/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1182/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1182/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1182/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1182/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT1182/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MIMXRT1182_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1182/iar/startup_MIMXRT1182.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1182/gcc/startup_MIMXRT1182.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1182/arm/startup_MIMXRT1182.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1182_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MIMXRT1182_system</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1182/system_MIMXRT1182.c" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1182/system_MIMXRT1182.h" projectpath="device"/>
        <file category="include" name="devices/MIMXRT1182/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="acmp" Cversion="2.3.0" condition="driver.acmp.condition_id">
      <description>ACMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_acmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_acmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
