vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1182_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pmu_1" Cversion="2.1.2" condition="driver.anadig_pmu_1.condition_id">
      <description>PMU Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_pmu.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_pmu.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aoi" Cversion="2.0.2" condition="driver.aoi.condition_id">
      <description>AOI Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_aoi.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_aoi.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="asrc" Cversion="2.1.3" condition="driver.asrc.condition_id">
      <description>asrc Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_asrc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_asrc.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="asrc_edma" Cversion="2.2.0" condition="driver.asrc_edma.condition_id">
      <description>asrc_edma Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_asrc_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_asrc_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_xcache" Cversion="2.0.3" condition="driver.cache_xcache.condition_id">
      <description>CACHE XCACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_cache.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.6" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="lpi2c_cmsis" Cversion="2.6.0" Capiversion="2.3.0" condition="driver.cmsis_lpi2c.condition_id">
      <description>LPI2C CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/cmsis_drivers/fsl_lpi2c_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1182/cmsis_drivers/fsl_lpi2c_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="lpspi_cmsis" Cversion="2.12.0" Capiversion="2.2.0" condition="driver.cmsis_lpspi.condition_id">
      <description>LPSPI CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/cmsis_drivers/fsl_lpspi_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1182/cmsis_drivers/fsl_lpspi_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis" Cversion="2.7.0" Capiversion="2.3.0" condition="driver.cmsis_lpuart.condition_id">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/cmsis_drivers/fsl_lpuart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1182/cmsis_drivers/fsl_lpuart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec" Cversion="2.3.1" condition="driver.codec.condition_id">
      <description>Driver codec</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/codec/fsl_codec_common.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/fsl_codec_common.c" projectpath="codec"/>
        <file category="include" name="components/codec/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.6.0" condition="driver.common.condition_id">
      <description>common Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_common.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_common.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm33.condition_id" category="sourceC" name="devices/MIMXRT1182/drivers/fsl_common_arm.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm33.condition_id" category="header" name="devices/MIMXRT1182/drivers/fsl_common_arm.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cs42448" Cversion="2.0.1" condition="driver.cs42448.condition_id">
      <description>Driver cs42448</description>
      <RTE_Components_h>
#ifndef CODEC_CS42448_ENABLE
#define CODEC_CS42448_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/cs42448/fsl_cs42448.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/cs42448/fsl_cs42448.c" projectpath="codec"/>
        <file category="include" name="components/codec/cs42448/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888" Cversion="2.1.3" condition="driver.cs42888.condition_id">
      <description>Driver cs42888</description>
      <RTE_Components_h>
#ifndef CODEC_CS42888_ENABLE
#define CODEC_CS42888_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/cs42888/fsl_cs42888.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/cs42888/fsl_cs42888.c" projectpath="codec"/>
        <file category="include" name="components/codec/cs42888/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dac" Cversion="2.1.2" condition="driver.dac12.condition_id">
      <description>DAC12 Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_dac12.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_dac12.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dcdc_soc" Cversion="2.0.1" condition="driver.dcdc_3.condition_id">
      <description>DCDC SOC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_dcdc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_dcdc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dialog7212" Cversion="2.3.1" condition="driver.dialog7212.condition_id">
      <description>Driver dialog7212</description>
      <RTE_Components_h>
#ifndef CODEC_DA7212_ENABLE
#define CODEC_DA7212_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/da7212/fsl_dialog7212.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/da7212/fsl_dialog7212.c" projectpath="codec"/>
        <file category="include" name="components/codec/da7212/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ecat" Cversion="2.0.1" condition="driver.ecat.condition_id">
      <description>the EtherCAT Controller Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_ecat.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_ecat.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="edma" Cversion="2.10.6" condition="driver.edma4.condition_id">
      <description>EDMA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_edma.h" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_edma_core.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="edma_soc" Cversion="2.1.0" condition="driver.edma_soc.condition_id">
      <description>EDMA SOC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_edma_soc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_edma_soc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
