vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1182_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trdc" Cversion="2.3.0" condition="driver.trdc.condition_id">
      <description>TRDC Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_trdc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_trdc.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tsl2561" Cversion="1.0.0" condition="driver.tsl2561.condition_id">
      <description>Driver tsl2561</description>
      <files>
        <file category="header" name="components/sensor/tsl2561/fsl_tsl2561.h" projectpath="tsl"/>
        <file category="sourceC" name="components/sensor/tsl2561/fsl_tsl2561.c" projectpath="tsl"/>
        <file category="include" name="components/sensor/tsl2561/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tstmr" Cversion="2.1.0" condition="driver.tstmr.condition_id">
      <description>TSTMR Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_tstmr.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_tstmr.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sdhc" Cversion="2.8.6" condition="driver.usdhc.condition_id">
      <description>USDHC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_usdhc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_usdhc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="vref" Cversion="2.4.0" condition="driver.vref_1.condition_id">
      <description>VREF Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_vref.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_vref.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524" Cversion="2.1.1" condition="driver.wm8524.condition_id">
      <description>Driver wm8524</description>
      <RTE_Components_h>
#ifndef CODEC_WM8524_ENABLE
#define CODEC_WM8524_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8524/fsl_wm8524.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8524/fsl_wm8524.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8524/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904" Cversion="2.5.1" condition="driver.wm8904.condition_id">
      <description>Driver wm8904</description>
      <RTE_Components_h>
#ifndef CODEC_WM8904_ENABLE
#define CODEC_WM8904_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8904/fsl_wm8904.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8904/fsl_wm8904.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8904/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960" Cversion="2.2.4" condition="driver.wm8960.condition_id">
      <description>Driver wm8960</description>
      <RTE_Components_h>
#ifndef CODEC_WM8960_ENABLE
#define CODEC_WM8960_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8960/fsl_wm8960.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8960/fsl_wm8960.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8960/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962" Cversion="2.2.0" condition="driver.wm8962.condition_id">
      <description>Driver wm8962</description>
      <RTE_Components_h>
#ifndef CODEC_WM8962_ENABLE
#define CODEC_WM8962_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8962/fsl_wm8962.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8962/fsl_wm8962.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8962/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="xbar" Cversion="2.1.2" condition="driver.xbar_1.condition_id">
      <description>XBAR Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/drivers/fsl_xbar.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1182/drivers/fsl_xbar.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1182/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="baremetal" Cversion="1.0.0" condition="middleware.baremetal.condition_id">
      <description>Middleware baremetal</description>
      <RTE_Components_h>
#ifndef SDK_OS_BAREMETAL
#define SDK_OS_BAREMETAL 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="middleware/bm/middleware.baremetal_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="misc_utilities" Cversion="1.1.1" condition="utilities.misc_utilities.condition_id">
      <description>
        Utilities which is needed for particular toolchain like the SBRK function required to address limitation between HEAP and STACK in GCC toolchain library.
      </description>
      <files>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/MIMXRT1182/utilities/fsl_syscall_stub.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/MIMXRT1182/utilities/fsl_sbrk.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc, mdk, cores=cm33.condition_id" category="sourceAsm" name="devices/MIMXRT1182/utilities/fsl_memcpy.S" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert" Cversion="1.0.0" condition="utility.assert.condition_id">
      <description>Utility assert</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/utilities/debug_console/fsl_assert.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/MIMXRT1182/utilities/debug_console/fsl_assert.c" projectpath="utilities"/>
        <file category="include" name="devices/MIMXRT1182/utilities/debug_console/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite" Cversion="1.0.0" condition="utility.assert_lite.condition_id">
      <description>Utility assert_lite</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/utilities/debug_console_lite/fsl_assert.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/MIMXRT1182/utilities/debug_console_lite/fsl_assert.c" projectpath="utilities"/>
        <file category="include" name="devices/MIMXRT1182/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console" Cversion="1.0.1" condition="utility.debug_console.condition_id">
      <description>Utility debug_console</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/utilities/debug_console/fsl_debug_console.h" projectpath="utilities/debug_console"/>
        <file category="sourceC" name="devices/MIMXRT1182/utilities/debug_console/fsl_debug_console.c" projectpath="utilities/debug_console"/>
        <file category="include" name="devices/MIMXRT1182/utilities/debug_console/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite" Cversion="1.0.0" condition="utility.debug_console_lite.condition_id">
      <description>Utility debug_console_lite</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/utilities/debug_console_lite/fsl_debug_console.h" projectpath="utilities/debug_console_lite"/>
        <file category="sourceC" name="devices/MIMXRT1182/utilities/debug_console_lite/fsl_debug_console.c" projectpath="utilities/debug_console_lite"/>
        <file category="include" name="devices/MIMXRT1182/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug console template config" Cversion="1.0.0" condition="utility.debug_console_template_config.condition_id">
      <description>Utility debug_console Template Config</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT1182/utilities/debug_console/config/fsl_debug_console_conf.h" version="1.0.0" projectpath="utilities/debug_console/config"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="incbin" Cversion="1.0.0" condition="utility.incbin.condition_id">
      <description>Used to include slave core binary into master core binary.</description>
      <files>
        <file condition="allOf.toolchains=armgcc, mdk.condition_id" category="sourceAsm" name="devices/MIMXRT1182/utilities/incbin/fsl_incbin.S" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="notifier" Cversion="1.0.0" condition="utility.notifier.condition_id">
      <description>Utility notifier</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1182/utilities/fsl_notifier.c" projectpath="utilities/utilities"/>
        <file category="header" name="devices/MIMXRT1182/utilities/fsl_notifier.h" projectpath="utilities/utilities"/>
        <file category="include" name="devices/MIMXRT1182/utilities/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="shell" Cversion="1.0.0" condition="utility.shell.condition_id">
      <description>Utility shell</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/utilities/shell/fsl_shell.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/MIMXRT1182/utilities/shell/fsl_shell.c" projectpath="utilities"/>
        <file category="include" name="devices/MIMXRT1182/utilities/shell/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="str" Cversion="1.0.0" condition="utility.str.condition_id">
      <description>Utility str</description>
      <files>
        <file category="header" name="devices/MIMXRT1182/utilities/str/fsl_str.h" projectpath="utilities/str"/>
        <file category="sourceC" name="devices/MIMXRT1182/utilities/str/fsl_str.c" projectpath="utilities/str"/>
        <file category="include" name="devices/MIMXRT1182/utilities/str/"/>
      </files>
    </component>
  </components>
</package>